complete wave 2 milestones
